# YOLOv8 customized model for 9-class road damage detection

nc: 9
ch: 3

depth_multiple: 0.50  
width_multiple: 0.75  

backbone:
  [[-1, 1, Conv, [48, 3, 2]],        
   [-1, 1, Conv, [96, 3, 2]],        
   [-1, 3, C2f, [96, True]],
   [-1, 1, Conv, [192, 3, 2]],       
   [-1, 6, C2f, [192, True]],
   [-1, 1, Conv, [384, 3, 2]],       
   [-1, 6, C2f, [384, True]],
   [-1, 1, Conv, [768, 3, 2]],       
   [-1, 3, C2f, [768, True]],
   [-1, 1, SPPF, [768, 5]]]          

head:
  [[-1, 1, Conv, [384, 1, 1]],         
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C2f, [384]],              

   [-1, 1, Conv, [192, 1, 1]],        
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C2f, [192]],               

   [-1, 1, Conv, [192, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C2f, [384]],               

   [-1, 1, Conv, [384, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C2f, [768]],               

   [[17, 20, 23], 1, Detect, [nc]]
  ]